from sut.enums import OpCode
operation_codes = {
    OpCode.opAdd: "+",
    OpCode.opSub: "-",
    OpCode.opOr: "||",
    OpCode.opMult: "*",
    OpCode.opDiv: "/",
    OpCode.opAnd: "&&",
    OpCode.opEq: "==",
    OpCode.opNotEq: "!=",
    OpCode.opGreat: ">",
    OpCode.opGreatEq: ">=",
    OpCode.opLess: "<",
    OpCode.opLessEq: "<=",
}

base_types = ["Int", "Float", "Boolean", "Void"]

bool_constants = ["true", "false"]

# таблица состояний автомата
conditions_table = [
    [ -1,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # ;
    [ -2,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # }
    [ -3,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # {
    [ -4,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # )
    [ -5,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # (
    [  1,  -6, -29, -14,   4, -29, -18, -20, -22, -23, -25, -30, -24, -30, -30, -24, -26], # =
    [ -8,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # ,
    [ -9,  -7, -29, -14,   4, -29, -17, -19, -21, -23,  11, -30, -24, -30, -30, -24, -26], # .
    [-10,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24,  14, -30, -24, -26], # +
    [-11,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24,  14, -30, -24, -26], # -
    [  2,  -7, -12, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # |
    [-13,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # *
    [  3,  -7, -29,   4,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # /
    [  5,  -7, -29, -14,   4, -16, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # &
    [  6,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # !
    [  7,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # >
    [  8,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # <
    [  9,  -7, -29, -14,   4, -29, -17, -19, -21,   9, -25, -30, -24, -30, -30, -24, -26], # l
    [-28,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # :
    [ 10,  -7, -29, -14,   4, -29, -17, -19, -21,   9,  10,  12,  12,  15,  15,  15, -26], # d
    [ 16,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24,  16], # sp
    [ 16,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24,  16], # tab
    [-27,  -7, -29, -14, -15, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26], # \n
    [  9,  -7, -29, -14,   4, -29, -17, -19, -21,   9,  13, -30,  13, -30, -30, -24, -26], # e
    [-31,  -7, -29, -14,   4, -29, -17, -19, -21, -23, -25, -30, -24, -30, -30, -24, -26] # ост.
]

errors = dict([(1, "Ошибка в синтаксисе операнда"), (2, "Ошибка в формате числа"),
               (3, "Неподдерживаемый символ")])

# статическая таблица ключевых слов
keyword_table = ("Boolean",  "data_class", "def", "else", "false", "Float",
                 "fun_main", "if", "Int",  "kotlin_prog", "true", "var")

# имена токенов (необработанные)
token_names = ["Bool",   "Data",  "Def",  "Else",    "False",
               "Float",  "Main",  "If",   "Int",     "Prog",
               "True",   "Var",   "Semi", "OpBrace", "ClBrace",
               "OpPar",  "ClPar", "Ass",  "Nl",      "Comma",
               "Exclam", "Add",   "Mult", "Rel",     "Pt",
               "Id",     "Num",   "Eof",  "Err"]

keyword_tokens = dict([("Boolean", "bool"), ("data_class", "data"),
                       ("def", "def"), ("else", "else"),
                       ("false", "false"), ("Float", "float"),
                       ("fun_main", "main"), ("if", "if"),
                       ("Int", "int"), ("kotlin_prog", "prog"),
                       ("true", "true"), ("var", "var")])

# имена атрибутов (необработанные)
attr_names = ["opAdd", "opSub", "opOr", "opMult", "opDiv", "opAnd",
            "opEq", "opNotEq", "opGreat", "opGreatEq", "opLess",
            "opLessEq"]



# соответствие между состоянием автомата и смещением по возврату
return_steps = dict([(-1, 0), (-2,0),  (-3,0),  (-4,0),
                     (-5,0),  (-6,0),  (-7,1),  (-8,0),
                     (-9,0),  (-10,0), (-11,0), (-12,0),
                     (-13,0), (-14,1), (-15,0), (-16,0),
                     (-17,1), (-18,0), (-19,1), (-20,0),
                     (-21,1), (-22,0), (-23,1), (-24,1),
                     (-25,1), (-26,1), (-27,0),
                     # ошибки
                     (-28,0), (-29,0), (-30, 0)])

# соответствие между состоянием автомата и человекочитаемым названием токена
human_read_tokens = dict([(-1, ";"), (-2, "}"), (-3, "{"), (-4, ")"),
                          (-5, "("), (-6, "=="), (-7, "="), (-8, ","),
                          (-9, "."), (-10, "+"), (-11, "-"), (-12, "||"),
                          (-13, "*"), (-14, "/"), (-15, "comment"),
                          (-16, "&&"), (-17, "!"), (-18, "!="), (-19, ">"),
                          (-20, ">="), (-21, "<"), (-22, "<="), (-23, "id"),
                          (-24, "float"), (-25, "int"), (-26, "space"),
                          (-27, "nl"), (-28, ":"), (-29, "err1"),
                          (-30, "err2"), (-31, "err3")])

# соответствие между символами и строками в таблице состояний
SYMBOL_MAP = {
    ';': 0, '}': 1, '{': 2, ')': 3, '(': 4,
    '=': 5, ',': 6, '.': 7, '+': 8, '-': 9,
    '|': 10, '*': 11, '/': 12, '&': 13, '!': 14,
    '>': 15, '<': 16, 'e': 23
}

# обработка имен токенов (присвоение целочисленных величин)
def process_token_codes(token_names):
    lc_names = ["ls" + name for name in token_names]
    token_codes = dict()
    id = 0
    for name in lc_names:
        token_codes[name] = (id, 0)
        id += 1
    return token_codes


# обработка имен атрибутов (присвоение целочисленных величин)
def process_atributes_codes(atr_names):
    atr_codes = dict()
    id = 0
    for name in atr_names:
        atr_codes[name] = id
        id += 1
    return atr_codes


def sort_keywords(keywords):
    """Сортирует список ключевых слов в лексикографическом порядке с учетом ASCII-кодов (регистрозависимо)."""
    return sorted(keywords, key=lambda x: [ord(c) for c in x])
